NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
        __LOG("VERSION: ");
        for (uint32_t i = 0; i < BL_INFO_LEN_FWID; ++i)
        {
            __LOG("%02x", ((uint8_t*) &new_version_entry)[i]);
        }
        __LOG("\n");
        m_bl_info_pointers.p_fwid  = &bootloader_info_entry_put(BL_INFO_TYPE_VERSION,
                &new_version_entry, BL_INFO_LEN_FWID)->version;
        m_bl_info_pointers.p_flags = &bootloader_info_entry_put(BL_INFO_TYPE_FLAGS,
                &flags_entry, BL_INFO_LEN_FLAGS)->flags;
        __LOG("Single bank meta stored.\n");
    }

    __LOG(RTT_CTRL_TEXT_GREEN RTT_CTRL_BG_RED "Transfer complete!" RTT_CTRL_RESET "\n");
    /* Reset the bootloader info page to make room for the next transfer. */
    SET_STATE(DFU_STATE_STABILIZE);
    bootloader_info_reset();
    return NRF_SUCCESS;
}

void dfu_mesh_restart(void)
{
    __LOG("Restart\n");
    start_find_fwid();
}

void dfu_mesh_on_flash_idle(void)
{
    /* check whether the blinfo module is done with all its stuff. */
    if (m_state == DFU_STATE_STABILIZE)
    {
        __LOG("DFU MESH: IDLE\n");
        if (bootloader_info_stable())
        {
            bl_evt_t end_evt;
            end_evt.type = BL_EVT_TYPE_DFU_END;
            end_evt.params.dfu.end.role = DFU_ROLE_TARGET;
            end_evt.params.dfu.end.dfu_type = m_transaction.type;
            fwid_union_cpy(&end_evt.params.dfu.end.fwid, &m_transaction.target_fwid_union, m_transaction.type);
            bootloader_evt_send(&end_evt);
            dfu_transfer_end();
            get_info_pointers();
            dfu_mesh_start();
        }
    }
}
